clear
options=gaoptimset('PlotFcns',@gaplotbestf,'TolFun',1e-8,'Generations',1000,'StallGenLimit',1000);
%TolFun  - 对健身功能值的终止容忍度
%?StallGenLimit  - 累积的代数?适应度函数值的变化小于TolFun
aeq=[1,1,1,1,1];
beq=[1];
LB=[0 ;0 ;0; 0; 0];
UB=[1; 1 ;1 ;1 ;1];
%约束条件：x(1)+x(2)+x(3)+x(4)+x(5)=1;x(1)，x(2)，x(3)，x(4)，x(5)均在[0,1]内
[x, val]=ga(@myobj,5,[],[],aeq,beq,LB,UB,[],[],options);
%x代表各个变量的值,val代表目标函数最小值

%目标函数
function [f] = myobj(x)
    
    f=((12.17-13.03*x(1)-11.35*x(2)-13.09*x(3)-11.92*x(4)-12.01*x(5))/12.17)^2+((0.053-0.053*x(1)-0.06*x(2)-0.065*x(3)-0.06*x(4)-0.066*x(5))/0.053)^2+((56-51.3*x(1)-51.3*x(2)-57.7*x(3)-55*x(4)-56.2*x(5))/56)^2+((1.15-1.24*x(1)-1.49*x(2)-1.02*x(3)-1.28*x(4)-1.18*x(5))/1.15)^2+((0.342-0.38*x(1)-0.382*x(2)-0.36*x(3)-0.36*x(4)-0.34*x(5))/0.342)^2+((18.3-18.76*x(1)-20.43*x(2)-18.78*x(3)-19.81*x(4)-19.6*x(5))/18.3)^2+((9.3-10.5*x(1)-9.6*x(2)-10.4*x(3)-9.9*x(4)-10.4*x(5))/9.3)^2;

end